# Даны длины трех отрезков. Напишите программу, которая проверяет, могут ли они являться сторонами треугольника.

a, b, c = map(float, input("Введите длины трех отрезков: ").split())
if a + b > c and a + c > b and b + c > a:
    print("Треугольник существует")
else:
    print("Треугольник не существует")
