# Дано натуральное число. Определите, будет ли это число: четным, кратным 4.

a = int(input("Введите число: "))
if a % 4 == 0:
        print("Это число четное и кратно 4")
elif a % 2 == 0 and a % 4 != 0:
        print("Это число четно, но не кратно 4")
else:
        print("Это число нечетно и не кратно 4")