# Определите количество цифр в десятичной записи целого положительного числа.

n = int(input("Введите число: "))
count = 0
while n > 0:
    n = n // 10
    count += 1
print(count)
