# Создать список чисел, которые делятся на 3, из диапазона от 1 до 50.

nums = [x for x in range(1, 51) if x % 3 == 0]
print(nums)
