#Напишите программу для вычисления площади треугольника по полученным от пользователя данным: основание и высота

a, h = map(float, input('Введите значения основания и высоты треугольника:').split())
print((a * h) / 2)
