#Дана температура в градусах Цельсия. Напишите программу для вычисления соответствующей температуры в градусах Фаренгейта.
#Формула перевода – tF = 9/5 * tC + 32

celsius = float(input("Введите температуру в Цельсиях:"))
fahrenheit = 9 / 5 * celsius + 32
print('Температура в Фаренгейтах: ', fahrenheit)