# Напишите программу для вычисления значения выражения

a, b, c, d, e, f, g, p, k = map(float, input('Введите аргументы a, b, c, d, e, f, g, p, k (9 чисел):').split())
print('Результат вычислений: ', (((a + b) * c + d * e / f) / (k + p * b / a + g)) * 4 / 5)
