# Компания проводит опрос общественного мнения и ее интересуют люди в возрасте от 20 до 70 лет включительно.
# Нужно написать программу, которая запрашивает возраст претендента и выдает ответ: «подходит» он или «не подходит» по этому признаку.

age = int(input("Введите свой возраст: "))
if age >= 20 and age <= 70:
    print("Вы нам подходите")
else:
    print("Вы нам не подходите")